package org.example;

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}

//git init - подключаем Git

// Создаем файл .gitignore
// В файле .gitignore пишем:
// *.sass
// /bin
// /admin
// /config

// Сохраняем

// Добавьте все файлы в локальное хранилище;
// git add -A
// git commit -m "DZ 5 local"

// Создайте новую ветку и перейдите в неё;
// git branch dz5
// git checkout dz5

// В новой ветке создайте папку blog с файлами: index.js, index.html;
//


